# DoubleWallMaterial Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..DoubleWallMaterial Property
FabricationPart Class See Also
---
The double wall material identifier of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int DoubleWallMaterial { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DoubleWallMaterial As Integer
	Get
```

Visual C++
---
```text
public:
property int DoubleWallMaterial {
	int get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace